src/cf/Catalogs/ПравилаРегистрацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаРегистрацииОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Регистрации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриОбработкеПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриОбработкеДополнительныйПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоСвойствамОбъекта</Name>
					<Comment>Дерево с элементами отбора по таблице шапки объекта</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоСвойствамПланаОбмена</Name>
					<Comment>Дерево с элементами отбора по таблице плана обмена</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитРежимаВыгрузкиОбъектовОбмена</Name>
					<Comment>Свойство плана обмена, которое используется для переключения режимов выгрузки объектов.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГруппы</Name>
					<Comment>Тип группы для групп по умолчанию "предопределенных"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Захвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТегВырезки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПакетнаяОбработкаРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыСвойств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидыСубконтоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Измерение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборЗаписейПодчиненногоРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборЗаписейПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодчиненныйСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свойство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоставПланаОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементСоставаПланаОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникПодпискиНаСобытие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Объекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Релизы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иерархический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИерархии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиватьКоличествоУровней</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУровней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерииКодов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>29</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольУникальности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНумерация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подчиненный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВышестоящегоРелиза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПравилаРегистрацииОбъектов/Forms/ФормаКопированиеПравилаРегистрации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ПравилоРегистрацииОбразец", ПравилоРегистрацииОбразец);
	ДанныеПРО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПравилоРегистрацииОбразец, "Владелец, ОбъектНастройки");
	Регистрация = ДанныеПРО.Владелец;
	ТипОбъектаНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПРО.ОбъектНастройки, "Тип");
	ДанныеФильтра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистрация, "ИмяПланаОбмена, Конфигурация");
	
	ИмяПланаОбмена = ДанныеФильтра.ИмяПланаОбмена;
	Конфигурация = ДанныеФильтра.Конфигурация;
	// Заполнение списка объектов.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СвойстваТипы.Тип                    КАК Объект,
		|	СвойстваТипы.Ссылка.Авторегистрация КАК Авторегистрация
		|ПОМЕСТИТЬ СоставПланаОбмена
		|ИЗ
		|	Справочник.Свойства.Типы КАК СвойстваТипы
		|ГДЕ
		|	  СвойстваТипы.Ссылка.Владелец.Имя = &ПланОбмена
		|	И СвойстваТипы.Ссылка.Владелец.Владелец = &Владелец
		|	И СвойстваТипы.Ссылка.Вид      = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ЭлементСоставаПланаОбмена)
		|;
		|
		|ВЫБРАТЬ
		|	СправочникОбъекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Объекты КАК СправочникОбъекты
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	СоставПланаОбмена КАК СоставПланаОбмена
		|ПО
		|	СправочникОбъекты.Ссылка = СоставПланаОбмена.Объект
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.ПравилаРегистрацииОбъектов КАК СуществующиеПравила
		|ПО СуществующиеПравила.ОбъектНастройки = СправочникОбъекты.Ссылка
		|	И СуществующиеПравила.Владелец = &Регистрация
		|	И СуществующиеПравила.ПометкаУдаления = ЛОЖЬ
		|
		|ГДЕ
		|	НЕ СправочникОбъекты.ПометкаУдаления
		|	И СправочникОбъекты.ЭтоГруппа = ЛОЖЬ
		|	И СправочникОбъекты.Владелец = &Владелец
		|	И СправочникОбъекты.Наименование <> ""РегистрСведенийЗапись.СоответствиеОбъектовИнформационныхБаз""
		|	И СправочникОбъекты.Тип = &ТипОбъектаНастройки
		|	И СуществующиеПравила.Ссылка ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	СправочникОбъекты.ЭтоГруппа ИЕРАРХИЯ,
		|	СправочникОбъекты.Наименование
		|";
	Запрос.УстановитьПараметр("ТипОбъектаНастройки", ТипОбъектаНастройки);
	Запрос.УстановитьПараметр("Регистрация", Регистрация);
	Запрос.УстановитьПараметр("Владелец", Конфигурация);
	Запрос.УстановитьПараметр("ПланОбмена", ИмяПланаОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектыДляКопирования.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаСервере
Процедура СкопироватьПравилоНаСервере()
	СозданоПравил = 0;
	Неудач = 0;
	КопируемыеРеквизиты = Новый Массив;
	КопируемыеРеквизиты.Добавить("РеквизитРежимаВыгрузкиОбъектовОбмена");
	КопируемыеРеквизиты.Добавить("ОтборПоСвойствамПланаОбмена");
	КопируемыеРеквизиты.Добавить("ОтборПоСвойствамОбъекта");
	КопируемыеРеквизиты.Добавить("АлгоритмПередОбработкойПравила");
	КопируемыеРеквизиты.Добавить("АлгоритмПриОбработкеПравила");
	КопируемыеРеквизиты.Добавить("АлгоритмПриОбработкеДополнительныйПравила");
	КопируемыеРеквизиты.Добавить("АлгоритмПослеОбработкиПравила");
	КопируемыеРеквизиты.Добавить("Родитель");  

	ДанныеДляКопирования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПравилоРегистрацииОбразец, КопируемыеРеквизиты);
	// Преобразуем отборы из хранилища в дерево значений.
	ОтборПоСвойствамХранилище = ДанныеДляКопирования.ОтборПоСвойствамПланаОбмена;
	ОтборПОСвойствамДерево = ОтборПоСвойствамХранилище.Получить();
	Если ТипЗнч(ОтборПОСвойствамДерево) = Тип("ДеревоЗначений") Тогда
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамПланаОбмена", ОтборПОСвойствамДерево);
	Иначе
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамПланаОбмена", Новый ДеревоЗначений);
	КонецЕсли;
	ОтборПоСвойствамХранилище = ДанныеДляКопирования.ОтборПоСвойствамОбъекта;
	ОтборПОСвойствамДерево = ОтборПоСвойствамХранилище.Получить();
	Если ТипЗнч(ОтборПОСвойствамДерево) = Тип("ДеревоЗначений") Тогда
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамОбъекта", ОтборПОСвойствамДерево);
	Иначе
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамОбъекта", Новый ДеревоЗначений);
	КонецЕсли;

	Для Каждого ЭлементСписка Из ОбъектыДляКопирования Цикл
		Если ЭлементСписка.Пометка Тогда
			Отказ = Ложь;
			СоздатьПРОПоОбразцу(ЭлементСписка.Значение, ДанныеДляКопирования, Отказ);
			Если Отказ Тогда
				Неудач = Неудач + 1;
			Иначе
				СозданоПравил = СозданоПравил + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТекстСообщения = НСтр("ru='Создано правил %1, неудачных попыток %2'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СозданоПравил);
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Неудач);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПравило(Команда)
	СкопироватьПравилоНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПРОПоОбразцу(ОбъектНастройки, ДанныеДляКопирования, Отказ)
	НовоеПРО = Справочники.ПравилаРегистрацииОбъектов.СоздатьЭлемент();
	НовоеПРО.Владелец = Регистрация;
	НовоеПРО.ОбъектНастройки = ОбъектНастройки;
	НовоеПРО.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектНастройки, "Синоним");
	ЗаполнитьЗначенияСвойств(НовоеПРО, ДанныеДляКопирования,,"ОтборПоСвойствамОбъекта, ОтборПоСвойствамПланаОбмена");
	// Отборы добавляются с учетом состава реквизитов объекта.
	ОбработатьОтборы(НовоеПРО, "ОтборПоСвойствамОбъекта", ДанныеДляКопирования.ОтборПоСвойствамОбъекта, Ложь);
	ОбработатьОтборы(НовоеПРО, "ОтборПоСвойствамПланаОбмена", ДанныеДляКопирования.ОтборПоСвойствамПланаОбмена, Истина);

	Попытка
		НовоеПРО.Записать();
	Исключение
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтборы(НовоеПРО, ИмяРеквизитаОтбор, ДеревоРеквизитаОтбор, ПроверятьСтрокаКонстанты)
	Если ДеревоРеквизитаОтбор.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ДеревоРезультат = ДеревоРеквизитаОтбор.Скопировать();
	Если ДеревоРезультат.Колонки.Найти("СвойствоОбъекта") <> Неопределено Тогда
		ОбработатьСтрокиДерева(НовоеПРО, ДеревоРезультат.Строки, ПроверятьСтрокаКонстанты);
	КонецЕсли;
	НовоеПРО[ИмяРеквизитаОтбор] = Новый ХранилищеЗначения(ДеревоРезультат);
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокиДерева(НовоеПРО, СтрокиДерева, ПроверятьСтрокаКонстанты)
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если ПроверятьСтрокаКонстанты И СтрокаДерева.ЭтоСтрокаКонстанты Тогда
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.СвойствоОбъекта) Тогда
			РеквизитНайден = Истина;
			ПозицияТочки = СтрНайти(СтрокаДерева.СвойствоОбъекта, ".");
			Если ПозицияТочки = 0 Тогда
				РеквизитОбъекта = Справочники.Свойства.НайтиПоНаименованию(СтрокаДерева.СвойствоОбъекта, Истина,Справочники.Свойства.ПустаяСсылка(),НовоеПРО.ОбъектНастройки);
				РеквизитНайден = ЗначениеЗаполнено(РеквизитОбъекта);
			Иначе
				ИмяТЧ = СокрЛП(Лев(СтрокаДерева.СвойствоОбъекта, ПозицияТочки-1));
				ИмяСвойства = СокрЛП(Сред(СтрокаДерева.СвойствоОбъекта, ПозицияТочки+1));
				РеквизитРодитель = Справочники.Свойства.НайтиПоНаименованию(ИмяТЧ, Истина,,НовоеПРО.ОбъектНастройки);
				Если ЗначениеЗаполнено(РеквизитРодитель) Тогда
					РеквизитОбъекта = Справочники.Свойства.НайтиПоНаименованию(ИмяСвойства, Истина,РеквизитРодитель,НовоеПРО.ОбъектНастройки);
					РеквизитНайден = ЗначениеЗаполнено(РеквизитОбъекта);
				Иначе
					РеквизитНайден = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если НЕ РеквизитНайден Тогда
				СтрокиКУдалению.Добавить(СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ОбработатьСтрокиДерева(НовоеПРО, СтрокаДерева.Строки, ПроверятьСтрокаКонстанты);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		СтрокиДерева.Удалить(СтрокаКУдалению);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
